src/Documents/ПриходныйКассовыйОрдер.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>ПриходныйКассовыйОрдер</Name>
			<Comment>Приходный кассовый ордер</Comment>
			<BasedOn>
				<xr:Item>Document.АвансовыйОтчет</xr:Item>
				<xr:Item>Document.ВозвратПоставщику</xr:Item>
				<xr:Item>Document.ЗаказПокупателя</xr:Item>
				<xr:Item>Document.Инкассация</xr:Item>
				<xr:Item>Document.ОтчетКомиссионера</xr:Item>
				<xr:Item>Document.РеализацияТоваров</xr:Item>
				<xr:Item>Document.РасходныйКассовыйОрдер</xr:Item>
				<xr:Item>Document.РеализацияАктивов</xr:Item>
				<xr:Item>Document.Инвентаризация</xr:Item>
				<xr:Item>Document.СчетНаОплату</xr:Item>
				<xr:Item>Document.ПланПоступленияДС</xr:Item>
				<xr:Item>Catalog.Контрагенты</xr:Item>
				<xr:Item>Document.ЗакрытиеСмены</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.СостоянияДокументов</xr:Item>
				<xr:Item>AccumulationRegister.ПлатежныйКалендарь</xr:Item>
				<xr:Item>AccumulationRegister.НаличныеРасчеты</xr:Item>
				<xr:Item>AccumulationRegister.КассыККМ</xr:Item>
				<xr:Item>AccumulationRegister.ВзаиморасчетыКомпании</xr:Item>
				<xr:Item>AccumulationRegister.ДоходыИРасходы</xr:Item>
				<xr:Item>AccumulationRegister.ДенежныеСредстваКомпании</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>КассаКомпании</Name>
					<Comment>Касса в которую принимают денежные средства</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.КассыКомпании</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Comment>Контрагент, у которого принимаются денежные средства</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорВзаиморасчетов</Name>
					<Comment>Договор по которому ведутся взаиморасчеты с контрагентом</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыВзаиморасчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КурсВалютыВзаиморасчетов</Name>
					<Comment>Курс валюты взаиморасчетов</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Comment>Документ, на основании которого введен данный</Comment>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ТипыСделок</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяДДС</Name>
					<Comment>Статья движения денежных средств</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сделка</Name>
					<Comment>Сделка</Comment>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ТипыСделок</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвтоЗакрытиеСделок</Name>
					<Comment>Если флажок установлен, то при проведении документа сначала будут оплачены все незакрытые сделки</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтавкаНДС</Name>
					<Comment>Ставка НДС</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаНДС</Name>
					<Comment>Сумма НДС по номенклатурной позиции</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументПланирования</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПланПоступленияДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПринятоОТ</Name>
					<Comment>Строковое описание, от кого приняты деньги</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Приложение</Name>
					<Comment>Приложение к документу</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Comment>На основании чего приняты денежные средства (например документ подтверждающий личность)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДляПробитияНаФР</Name>
					<Comment>Для пробития на фискальном регистраторе</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФР</Name>
					<Comment>ФР на котором был пробит чек</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодключаемоеОборудование</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КассаККМ</Name>
					<Comment>Касса ККМ, на которой пробивается чек</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.КассыККМ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерСмены</Name>
					<Comment>Номер смены ФР</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерЧека</Name>
					<Comment>Фискальный номер чека пробитого на ФР</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерДокумента</Name>
					<Comment>Сквозной номер документа ФР</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаФР</Name>
					<Comment>Дата пробития чека на ФР</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипСпособаРасчетаККТ</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыСпособаРасчетаККТ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
					<Comment>Набор реквизитов, состав которого определяется компанией</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
					<Comment>Проданные товары и услуги</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Comment>Номенклатура (товар, услуга)</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Comment>Количество единиц измерения номенклатуры</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Comment>Единица измерения номенклатурной позиции</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Коэффициент</Name>
							<Comment>Коэффициент пересчета по отношению к базовой единице номенклатуры</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Comment>Цена номенклатурной позиции</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Comment>Сумма всегда без скидки. НДС входит в сумму если это указано в типе цен. Сумма всегда равна Цена*Количество</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаСкидкиСтроки</Name>
							<Comment>Сумма скидки строки</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНДС</Name>
							<Comment>Ставка НДС по номенклатурной позиции</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.СтавкиНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДС</Name>
							<Comment>Сумма НДС по номенклатурной позиции</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХарактеристикаНоменклатуры</Name>
							<Comment>Характеристика/серия номенклатуры</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаВсего</Name>
							<Comment>Сумма всего</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаОплаты</Name>
							<Comment>Сумма оплаты</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоговорВзаиморасчетов</Name>
							<Comment>Договор</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ДоговорыВзаиморасчетов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПроцентСкидки</Name>
							<Comment>Процент скидки на продаваемый товар</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаСкидки</Name>
							<Comment>Сумма скидки по строке документа</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СкидкаНаТовар</Name>
							<Comment>Скидка на товар</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ТипыСкидок</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПроцентСкидкиСтроки</Name>
							<Comment>Процент скидки строки</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/AccumulationRegisters/НаличныеРасчеты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<AccumulationRegister>
		<Properties>
			<Name>НаличныеРасчеты</Name>
			<Comment>Блок учета наличных расчетов</Comment>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Comment>Сумма наличной оплаты в валюте взаиморасчетов с контрагентом</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаРег</Name>
					<Comment>Сумма рег.</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ХозОперация</Name>
					<Comment>Хозяйственная операция</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ХозОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ДоговорВзаиморасчетов</Name>
					<Comment>Договор взаиморасчетов с контрагентом</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыВзаиморасчетов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/Documents/ПриходныйКассовыйОрдер/Ext/ObjectModule.bsl
// Модуль объекта документа "Приходный кассовый ордер"

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда


////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

// Производит заполнение объекта на основании остатков взаиморасчетов по переданной сделке.
//
// Параметры:
//  ДанныеЗаполнения     - Произвольный - Значение, которое используется как основание для заполнения.
//  ТекстЗаполнения      - Строка       - Текст, используемый для заполнения объекта.
//  СтандартнаяОбработка - Булево       - В данный параметр передается признак выполнения системной обработки события.
//
Процедура ЗаполнитьОстаткомПоСделке()
	
	// Вычислим сумму
	СтруктураОтбора = Новый Структура("Контрагент,ДоговорВзаиморасчетов,Сделка", Контрагент, ДоговорВзаиморасчетов, ДокументОснование);
	
	тзДолги = РегистрыНакопления.ВзаиморасчетыКомпании.Остатки(ТекущаяДатаСеанса(), СтруктураОтбора,, "Сумма,СуммаУпр,СуммаБаз");
	
	Если ДокументОснование.ДоговорВзаиморасчетов.ВалютаВзаиморасчетов=ВалютаДокумента Тогда
		ОстатокПоСделке = РаботаСКурсамиВалютПлатформа.ПересчетПоВалюте(тзДолги.Итог("Сумма"), ДокументОснование.ДоговорВзаиморасчетов.ВалютаВзаиморасчетов, ДокументОснование.КурсДокумента, ВалютаДокумента, КурсДокумента);
		
	ИначеЕсли ВалютаДокумента=Константы.ВалютаРегламентированногоУчетаОрганизаций.Получить() Тогда
		ОстатокПоСделке = тзДолги.Итог("СуммаБаз");
		
	Иначе
		ОстатокПоСделке = РаботаСКурсамиВалютПлатформа.ПересчетПоВалюте(тзДолги.Итог("СуммаУпр"), Константы.ВалютаУправленческогоУчетаКомпании.Получить(), ДокументОснование.КурсВалютыУпр, ВалютаДокумента, КурсДокумента);
	КонецЕсли;
	
	СуммаДокумента	= Макс(ОстатокПоСделке,0);
	Документы.ПриходныйКассовыйОрдер.СуммаДокументаПриИзменении(ЭтотОбъект,ДополнительныеСвойства.ПараметрыДействия);
	
	// Статья ДДС - Оплата от покупателя
	СтатьяДДС = Справочники.СтатьиДДС.ОплатаОтПокупателя;
	
КонецПроцедуры // ЗаполнитьОстаткомПоСделке()


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ЗАПОЛНЕНИЯ ОБЪЕКТА

// Производит заполнение объекта на основании документа "Счет на оплату"
//
// Параметры:
//  ДанныеЗаполнения     - Произвольный - Значение, которое используется как основание для заполнения.
//  ТекстЗаполнения      - Строка       - Текст, используемый для заполнения объекта.
//  СтандартнаяОбработка - Булево       - В данный параметр передается признак выполнения системной обработки события.
//
Функция ОбработкаЗаполнения_СчетНаОплату(ДанныеЗаполнения, ТекстЗаполнения="", СтандартнаяОбработка=ИСТИНА, НаОснованииЗаказа=ЛОЖЬ) Экспорт
	
	// Вызываем общий обработчик заполнения
	Если НЕ ОбработкаСобытийДокументаСервер.ОбработкаЗаполненияНаОсновании(ЭтотОбъект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка) Тогда
		Возврат ИСТИНА;
	КонецЕсли;
	
	ВремКомментарий = "";
	ОперативнаяОтметкаВремени = ТекущаяДатаСеанса();
	
	// Проверим сумму предоплаты
	ТекстЗапроса = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВзаиморасчетыКомпанииОстаткиИОбороты.СуммаРасход КАК Сумма,
	|	ВзаиморасчетыКомпанииОстаткиИОбороты.СуммаУпрРасход КАК СуммаУпр
	|ИЗ
	|	РегистрНакопления.ВзаиморасчетыКомпании.Обороты(,,,
	|		Контрагент = &Контрагент
	|		И ДоговорВзаиморасчетов = &ДоговорВзаиморасчетов
	|		И (Сделка = &Сделка ИЛИ Сделка.ДокументОснование = &Сделка)
	|	) КАК ВзаиморасчетыКомпанииОстаткиИОбороты";
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Контрагент",            ДокументОснование.Контрагент);
	Запрос.УстановитьПараметр("ДоговорВзаиморасчетов", ДокументОснование.ДоговорВзаиморасчетов);
	Запрос.УстановитьПараметр("Сделка",                ДокументОснование);
	
	тзОплаты = Запрос.Выполнить().Выгрузить();
	
	Если НаОснованииЗаказа Тогда
		
		ТаблицаДолгов = ЗаказыСервер.ДолгиПоПредоплате(ЭтотОбъект, ДокументОснование);
		Если ТаблицаДолгов.Количество()>0 Тогда
			ДокументОснованиеСуммаДокумента = 0;
			Для Каждого ТекСтрока Из ТаблицаДолгов Цикл
				ДокументОснованиеСуммаДокумента = ДокументОснованиеСуммаДокумента + ТекСтрока.СуммаЗаказа;
			КонецЦикла;
			ДокументОснованиеСуммаДокумента = РаботаСКурсамиВалютПлатформа.ПересчетПоВалюте(ДокументОснованиеСуммаДокумента, ДокументОснование.ДоговорВзаиморасчетов.ВалютаВзаиморасчетов, Дата, ВалютаДокумента, Дата, РежимОкругления.Окр15как20);
		Иначе
			ДокументОснованиеСуммаДокумента = ДокументОснование.СуммаДокумента;
			ДокументОснованиеСуммаДокумента = РаботаСКурсамиВалютПлатформа.ПересчетПоВалюте(ДокументОснованиеСуммаДокумента, ДокументОснование.ВалютаДокумента, Дата, ВалютаДокумента, Дата, РежимОкругления.Окр15как20);
		КонецЕсли;
		
	Иначе
		ДокументОснованиеСуммаДокумента = ДокументОснование.СуммаДокумента;
		ДокументОснованиеСуммаДокумента = РаботаСКурсамиВалютПлатформа.ПересчетПоВалюте(ДокументОснованиеСуммаДокумента, ДокументОснование.ВалютаДокумента, Дата, ВалютаДокумента, Дата, РежимОкругления.Окр15как20);
	КонецЕсли;
		
	Если ДоговорВзаиморасчетов.ВалютаВзаиморасчетов = ВалютаДокумента Тогда
		Оплачено = РаботаСКурсамиВалютПлатформа.ПересчетПоВалюте(тзОплаты.Итог("Сумма"), ДоговорВзаиморасчетов.ВалютаВзаиморасчетов,Дата,ВалютаДокумента,Дата,РежимОкругления.Окр15как20);
		Если ТипЗнч(ДокументОснование)=Тип("ДокументСсылка.ЗаказПокупателя") Тогда
			СуммаПредоплаты = ДокументОснование.СуммаПредоплаты;
		Иначе
			СуммаПредоплаты = ДокументОснованиеСуммаДокумента;
		КонецЕсли;
	Иначе
		Оплачено = тзОплаты.Итог("СуммаУпр");
		Оплачено = РаботаСКурсамиВалютПлатформа.ПересчетПоВалюте(Оплачено,Константы.ВалютаУправленческогоУчетаКомпании.Получить(),Дата, ВалютаДокумента, ?(НЕ ЗначениеЗаполнено(КурсДокумента), Дата, КурсДокумента),РежимОкругления.Окр15как20);
		Если НаОснованииЗаказа Тогда
			СуммаПредоплаты = РаботаСКурсамиВалютПлатформа.ПересчетПоВалюте(ДокументОснование.СуммаПредоплаты, ДокументОснование.ВалютаДокумента, ДокументОснование.Дата, ВалютаДокумента, Дата, РежимОкругления.Окр15как20);
		Иначе
			СуммаПредоплаты = ДокументОснованиеСуммаДокумента;
		КонецЕсли;
	КонецЕсли;
	Если СуммаПредоплаты > Оплачено Тогда
		СуммаДокумента  = СуммаПредоплаты-Оплачено;
		ВремКомментарий = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='Предоплата по документу <%1>'"), ДокументОснование);
	Иначе
		СуммаДокумента  = ДокументОснованиеСуммаДокумента-Оплачено;
	КонецЕсли;
	
	СуммаДокумента	= Макс(СуммаДокумента,0);
	Документы.ПриходныйКассовыйОрдер.СуммаДокументаПриИзменении(ЭтотОбъект,ДополнительныеСвойства.ПараметрыДействия);
	
	// Статья ДДС - Оплата от покупателя
	СтатьяДДС = Справочники.СтатьиДДС.ОплатаОтПокупателя;
	
	Если НЕ ПустаяСтрока(ВремКомментарий) Тогда
		Комментарий = ВремКомментарий;
	КонецЕсли;
	
	// Возвращаем признак возможности дальнейшей обработки события
	Возврат ИСТИНА;
	
КонецФункции // ОбработкаЗаполнения_СчетНаОплату()

// Производит заполнение объекта на основании документа "Заказ покупателя"
//
// Параметры:
//  ДанныеЗаполнения     - Произвольный - Значение, которое используется как основание для заполнения.
//  ТекстЗаполнения      - Строка       - Текст, используемый для заполнения объекта.
//  СтандартнаяОбработка - Булево       - В данный параметр передается признак выполнения системной обработки события.
//
Функция ОбработкаЗаполнения_ЗаказПокупателя(ДанныеЗаполнения, ТекстЗаполнения="", СтандартнаяОбработка=ИСТИНА) Экспорт
	
	// Вызываем обработчик заполнения на основании документа "Счет на оплату"
	Возврат ОбработкаЗаполнения_СчетНаОплату(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка, ИСТИНА);
	
КонецФункции // ОбработкаЗаполнения_ЗаказПокупателя()

// Производит заполнение объекта на основании документа "Расходный кассовый ордер"
//
// Параметры:
//  ДанныеЗаполнения     - Произвольный - Значение, которое используется как основание для заполнения.
//  ТекстЗаполнения      - Строка       - Текст, используемый для заполнения объекта.
//  СтандартнаяОбработка - Булево       - В данный параметр передается признак выполнения системной обработки события.
//
Функция ОбработкаЗаполнения_РасходныйКассовыйОрдер(ДанныеЗаполнения, ТекстЗаполнения="", СтандартнаяОбработка=ИСТИНА) Экспорт
	
	// Вызываем общий обработчик заполнения
	Если НЕ ОбработкаСобытийДокументаСервер.ОбработкаЗаполненияНаОсновании(ЭтотОбъект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка) Тогда
		Возврат ИСТИНА;
	КонецЕсли;
	
	Если ТипЗнч(ДокументОснование)=Тип("ДокументСсылка.АвансовыйОтчет") Тогда
		ХозОперация = Справочники.ХозОперации.ВозвратДенежныхСредствОтПодотчетника;
	КонецЕсли;
	
	СтруктураОтбора = Новый Структура("Контрагент,ДоговорВзаиморасчетов", ДокументОснование.Контрагент, ДокументОснование.ДоговорВзаиморасчетов);
	Если ТипЗнч(ДокументОснование)=Тип("ДокументСсылка.РасходныйКассовыйОрдер") И ЗначениеЗаполнено(ДокументОснование.Сделка) Тогда
		СтруктураОтбора.Вставить("Сделка", ДокументОснование.Сделка);
		Сделка = ДокументОснование.Сделка;
	КонецЕсли;
	
	тзДолги=РегистрыНакопления.ВзаиморасчетыКомпании.Остатки(,СтруктураОтбора,,"Сумма,СуммаУпр,СуммаБаз");
	Если ВалютаДокумента=ДокументОснование.ДоговорВзаиморасчетов.ВалютаВзаиморасчетов Тогда
		Долг = РаботаСКурсамиВалютПлатформа.ПересчетПоВалюте(тзДолги.Итог("Сумма"), ДокументОснование.ДоговорВзаиморасчетов.ВалютаВзаиморасчетов, ДокументОснование.Дата, ВалютаДокумента, ДокументОснование.Дата, РежимОкругления.Окр15как20);
		
	ИначеЕсли ВалютаДокумента=Константы.ВалютаРегламентированногоУчетаОрганизаций.Получить() Тогда
		Долг = тзДолги.Итог("СуммаБаз");
	Иначе
		Долг = РаботаСКурсамиВалютПлатформа.ПересчетПоВалюте(тзДолги.Итог("СуммаУпр"), Константы.ВалютаУправленческогоУчетаКомпании.Получить(), ДокументОснование.Дата, ВалютаДокумента, ДокументОснование.Дата, РежимОкругления.Окр15как20);
	КонецЕсли;
	
	СуммаДокумента = Макс(Долг,0);
	Документы.ПриходныйКассовыйОрдер.СуммаДокументаПриИзменении(ЭтотОбъект,ДополнительныеСвойства.ПараметрыДействия);
	
	// Статья ДДС - Возврат из подотчета
	СтатьяДДС = Справочники.СтатьиДДС.ВозвратИзПодОтчета;
	
	// Возвращаем признак возможности дальнейшей обработки события
	Возврат ИСТИНА;
	
КонецФункции // ОбработкаЗаполнения_РасходныйКассовыйОрдер()

// Производит заполнение объекта на основании документа "Авансовый отчет"
//
// Параметры:
//  ДанныеЗаполнения     - Произвольный - Значение, которое используется как основание для заполнения.
//  ТекстЗаполнения      - Строка       - Текст, используемый для заполнения объекта.
//  СтандартнаяОбработка - Булево       - В данный параметр передается признак выполнения системной обработки события.
//
Функция ОбработкаЗаполнения_АвансовыйОтчет(ДанныеЗаполнения, ТекстЗаполнения="", СтандартнаяОбработка=ИСТИНА) Экспорт
	
	// Вызываем обработчик заполнения на основании документа "Расходный кассовый ордер"
	Возврат ОбработкаЗаполнения_РасходныйКассовыйОрдер(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка);
	
КонецФункции // ОбработкаЗаполнения_АвансовыйОтчет()

// Производит заполнение объекта на основании документа "Инкассация"
//
// Параметры:
//  ДанныеЗаполнения     - Произвольный - Значение, которое используется как основание для заполнения.
//  ТекстЗаполнения      - Строка       - Текст, используемый для заполнения объекта.
//  СтандартнаяОбработка - Булево       - В данный параметр передается признак выполнения системной обработки события.
//
Функция ОбработкаЗаполнения_Инкассация(ДанныеЗаполнения, ТекстЗаполнения="", СтандартнаяОбработка=ИСТИНА) Экспорт
	
	// Вызываем общий обработчик заполнения
	Если НЕ ОбработкаСобытийДокументаСервер.ОбработкаЗаполненияНаОсновании(ЭтотОбъект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка) Тогда
		Возврат ИСТИНА;
	КонецЕсли;
	
	ИзменилсяКонтрагент = (Контрагент            <> ДокументОснование.Инкассатор);
	ИзменилсяДоговор    = (ДоговорВзаиморасчетов <> ДокументОснование.ДоговорВзаиморасчетовИнкассатор);
	
	Контрагент            = ДокументОснование.Инкассатор;
	ДоговорВзаиморасчетов = ДокументОснование.ДоговорВзаиморасчетовИнкассатор;
	
	Если ИзменилсяКонтрагент Тогда
		Документы.ПриходныйКассовыйОрдер.КонтрагентПриИзменении(ЭтотОбъект,ДополнительныеСвойства.ПараметрыДействия);
	КонецЕсли;
	
	Если ИзменилсяДоговор Тогда
		Документы.ПриходныйКассовыйОрдер.ДоговорВзаиморасчетовПриИзменении(ЭтотОбъект,ДополнительныеСвойства.ПараметрыДействия);
	КонецЕсли;
	
	Оплаты = ДокументОснование.Оплаты.Выгрузить();
	Оплаты.Свернуть("ТипОплаты", "Сумма,СуммаВозврат");
	
	СтрокаОплатНаличными = Оплаты.Найти(Справочники.ТипыОплат.Наличные, "ТипОплаты");
	Если СтрокаОплатНаличными=Неопределено Тогда
		СуммаДокумента = 0;
	Иначе
		СуммаОплаты = СтрокаОплатНаличными.Сумма + СтрокаОплатНаличными.СуммаВозврат;
		СуммаДокумента = РаботаСКурсамиВалютПлатформа.ПересчетПоВалюте(СуммаОплаты, ДокументОснование.ВалютаДокумента, ДокументОснование.КурсДокумента, ВалютаДокумента, Дата);
	КонецЕсли;
	
	Документы.ПриходныйКассовыйОрдер.СуммаДокументаПриИзменении(ЭтотОбъект,ДополнительныеСвойства.ПараметрыДействия);
	КурсВалютыВзаиморасчетов = РаботаСКурсамиВалютПлатформа.ПолучитьКурсВалютыВзаиморасчетов(ЭтотОбъект, ДоговорВзаиморасчетов, ДокументОснование);
	
	// Возвращаем признак возможности дальнейшей обработки события
	Возврат ИСТИНА;
	
КонецФункции // ОбработкаЗаполнения_Инкассация()

// Производит заполнение объекта на основании документа "Инвентаризация"
//
// Параметры:
//  ДанныеЗаполнения     - Произвольный - Значение, которое используется как основание для заполнения.
//  ТекстЗаполнения      - Строка       - Текст, используемый для заполнения объекта.
//  СтандартнаяОбработка - Булево       - В данный параметр передается признак выполнения системной обработки события.
//
Функция ОбработкаЗаполнения_Инвентаризация(ДанныеЗаполнения, ТекстЗаполнения="", СтандартнаяОбработка=ИСТИНА) Экспорт
	
	// Если данные заполнения не указаны, значит производится проверка существования обработчика заполнения у объекта.
	Если НЕ ЗначениеЗаполнено(ДанныеЗаполнения) Тогда
		Возврат ИСТИНА;
	КонецЕсли;
	
	Если НЕ ДанныеЗаполнения.ХозОперация=Справочники.ХозОперации.ИнвентаризацияТоваровОтданныхНаКомиссию Тогда
		УправлениеДиалогомСервер.ЗапретитьОткрытиеФормыОбъекта(ЭтотОбъект, НСтр("ru='Можно вводить только на основании инвентаризации товаров отданных на комиссию.'"));
		Возврат ЛОЖЬ;
	КонецЕсли;
	
	// Вызываем общий обработчик заполнения
	Если НЕ ОбработкаСобытийДокументаСервер.ОбработкаЗаполненияНаОсновании(ЭтотОбъект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка) Тогда
		Возврат ИСТИНА;
	КонецЕсли;
	
	ТекстЗапроса = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СУММА(ИнвентаризацияТовары.Сумма) КАК Сумма
	|ИЗ
	|	Документ.Инвентаризация.Товары КАК ИнвентаризацияТовары
	|ГДЕ
	|	 ИнвентаризацияТовары.Ссылка = &ДокументОснование И ИнвентаризацияТовары.Количество < 0";
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("ДокументОснование", ДокументОснование);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() И ЗначениеЗаполнено(Выборка.Сумма) Тогда
		СуммаДокумента = РаботаСКурсамиВалютПлатформа.ПересчетПоВалюте(-Выборка.Сумма, ДокументОснование.ВалютаДокумента, ДокументОснование.КурсДокумента, ВалютаДокумента, Дата);
	КонецЕсли;
	
	Документы.ПриходныйКассовыйОрдер.СуммаДокументаПриИзменении(ЭтотОбъект,ДополнительныеСвойства.ПараметрыДействия);
	
	// Статья ДДС - Оплата от покупателя
	СтатьяДДС = Справочники.СтатьиДДС.ОплатаОтПокупателя;
	
	// Возвращаем признак возможности дальнейшей обработки события
	Возврат ИСТИНА;
	
КонецФункции // ОбработкаЗаполнения_Инвентаризация()

// Производит заполнение объекта на основании документа "Реализация активов"
//
// Параметры:
//  ДанныеЗаполнения     - Произвольный - Значение, которое используется как основание для заполнения.
//  ТекстЗаполнения      - Строка       - Текст, используемый для заполнения объекта.
//  СтандартнаяОбработка - Булево       - В данный параметр передается признак выполнения системной обработки события.
//
Функция ОбработкаЗаполнения_РеализацияАктивов(ДанныеЗаполнения, ТекстЗаполнения="", СтандартнаяОбработка=ИСТИНА) Экспорт
	
	// Вызываем общий обработчик заполнения
	Если НЕ ОбработкаСобытийДокументаСервер.ОбработкаЗаполненияНаОсновании(ЭтотОбъект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка) Тогда
		Возврат ИСТИНА;
	КонецЕсли;
	
	Контрагент = ДокументОснование.Контрагент;
	
	// вычислим сумму к оплате
	СуммаДок = ДокументОснование.Активы.Итог("Сумма");
	НДС      = ДокументОснование.Активы.Итог("СуммаНДС");
	СуммаДокумента = РаботаСКурсамиВалютПлатформа.ПересчетПоВалюте(СуммаДок, ДокументОснование.ВалютаДокумента, ДокументОснование.КурсДокумента, ВалютаДокумента, Дата);
	СуммаНДС       = РаботаСКурсамиВалютПлатформа.ПересчетПоВалюте(НДС,      ДокументОснование.ВалютаДокумента, ДокументОснование.КурсДокумента, ВалютаДокумента, Дата);
	
	// Статья ДДС - Оплата от покупателя
	СтатьяДДС = Справочники.СтатьиДДС.ОплатаОтПокупателя;
	
	// Возвращаем признак возможности дальнейшей обработки события
	Возврат ИСТИНА;
	
КонецФункции // ОбработкаЗаполнения_РеализацияАктивов()

// Производит заполнение объекта на основании документа "План поступления д/с"
//
// Параметры:
//  ДанныеЗаполнения     - Произвольный - Значение, которое используется как основание для заполнения.
//  ТекстЗаполнения      - Строка       - Текст, используемый для заполнения объекта.
//  СтандартнаяОбработка - Булево       - В данный параметр передается признак выполнения системной обработки события.
//
Функция ОбработкаЗаполнения_ПланПоступленияДС(ДанныеЗаполнения, ТекстЗаполнения="", СтандартнаяОбработка=ИСТИНА) Экспорт
	
	// Вызываем общий обработчик заполнения
	Если НЕ ОбработкаСобытийДокументаСервер.ОбработкаЗаполненияНаОсновании(ЭтотОбъект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка) Тогда
		Возврат ИСТИНА;
	КонецЕсли;
	
	СуммаДокумента = ДокументОснование.СуммаДокумента;
	Документы.ПриходныйКассовыйОрдер.СуммаДокументаПриИзменении(ЭтотОбъект,ДополнительныеСвойства.ПараметрыДействия);
	
	// В зависимости от хоз операции документа основания будем подставлять Кассу или нет.
	Если ДокументОснование.ХозОперация=Справочники.ХозОперации.ПланПоступленияВКассу Тогда
		КассаКомпании = ДокументОснование.СтруктурнаяЕдиница;
	КонецЕсли;
	
	Сделка               = ДокументОснование.ДокументОснование;
	ДокументПланирования = ДокументОснование;
	
	// Возвращаем признак возможности дальнейшей обработки события
	Возврат ИСТИНА;
	
КонецФункции // ОбработкаЗаполнения_ПланПоступленияДС()

Функция ОбработкаЗаполнения_ЗакрытиеСмены(ДанныеЗаполнения, ТекстЗаполнения="", СтандартнаяОбработка=ИСТИНА) Экспорт
	
	// Вызываем общий обработчик заполнения
	Если НЕ ОбработкаСобытийДокументаСервер.ОбработкаЗаполненияНаОсновании(ЭтотОбъект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка) Тогда
		Возврат ИСТИНА;
	КонецЕсли;
	
	Если НЕ ПодразделениеКомпании.ОсновнойИнкассатор = Справочники.Контрагенты.ПустаяСсылка() Тогда
		Контрагент = ПодразделениеКомпании.ОсновнойИнкассатор;
	Иначе
		Контрагент = Справочники.Контрагенты.ПустаяСсылка();
	КонецЕсли;
	 
	Оплаты = ДокументОснование.Оплаты.Выгрузить();
	Оплаты.Свернуть("ТипОплаты", "Сумма, СуммаНДС");
	
	ВозвратОплаты = ДокументОснование.ВозвратОплаты.Выгрузить();
	ВозвратОплаты.Свернуть("ТипОплаты", "Сумма");
	
	СтрокаОплатНаличными = Оплаты.Найти(Справочники.ТипыОплат.Наличные, "ТипОплаты");
	Если СтрокаОплатНаличными=Неопределено Тогда
		СуммаДокумента = 0;
	Иначе
		СуммаОплаты = СтрокаОплатНаличными.Сумма + СтрокаОплатНаличными.СуммаНДС;
		
		СтрокаВозвратаОплатНаличными = ВозвратОплаты.Найти(Справочники.ТипыОплат.Наличные, "ТипОплаты");
		Если НЕ СтрокаВозвратаОплатНаличными = Неопределено Тогда
			СуммаОплаты = СуммаОплаты - СтрокаВозвратаОплатНаличными.Сумма;
		КонецЕсли;
		
		СуммаДокумента = РаботаСКурсамиВалютПлатформа.ПересчетПоВалюте(СуммаОплаты, ДокументОснование.ВалютаДокумента, ДокументОснование.КурсДокумента, ВалютаДокумента, Дата);
	КонецЕсли;
	
	Документы.ПриходныйКассовыйОрдер.СуммаДокументаПриИзменении(ЭтотОбъект,ДополнительныеСвойства.ПараметрыДействия);
	КурсВалютыВзаиморасчетов = РаботаСКурсамиВалютПлатформа.ПолучитьКурсВалютыВзаиморасчетов(ЭтотОбъект, ДоговорВзаиморасчетов, ДокументОснование);
	
	// расчет суммы НДС
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	СУММА(ЗакрытиеСменыТовары.СуммаВсего) КАК СуммаВсего,
	                      |	СУММА(ЗакрытиеСменыТовары.СуммаНДС) КАК СуммаНДС,
	                      |	ЗакрытиеСменыТовары.Ссылка КАК Ссылка
	                      |ИЗ
	                      |	Документ.ЗакрытиеСмены.Товары КАК ЗакрытиеСменыТовары
	                      |ГДЕ
	                      |	ЗакрытиеСменыТовары.Ссылка = &Ссылка
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	ЗакрытиеСменыТовары.Ссылка");
	Запрос.УстановитьПараметр("Ссылка",ДокументОснование);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Если Выборка.СуммаВсего=0 Тогда
			СуммаНДС = 0;
		Иначе
			Коэффициент = СуммаДокумента/Выборка.СуммаВсего;
			СуммаНДСОплаты = Окр(Выборка.СуммаНДС*Коэффициент,2);
			СуммаНДС = РаботаСКурсамиВалютПлатформа.ПересчетПоВалюте(СуммаНДСОплаты, ДокументОснование.ВалютаДокумента, ДокументОснование.КурсДокумента, ВалютаДокумента, Дата);
		КонецЕсли;
	Иначе
		СуммаНДС = 0;
	КонецЕсли;

	ДокументПланирования = ДокументОснование;
	
	// Возвращаем признак возможности дальнейшей обработки события
	Возврат ИСТИНА;
	
КонецФункции // ОбработкаЗаполнения_ЗакрытиеСмены()


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ФОРМИРОВАНИЯ ДВИЖЕНИЙ


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ ОСНОВНЫХ СОБЫТИЙ ОБЪЕКТА

// Обработчик события заполнения объекта как при создании нового, так и при вводе на основании существующего.
//
// Параметры:
//  ДанныеЗаполнения     - Произвольный - Значение, которое используется как основание для заполнения.
//  ТекстЗаполнения      - Строка       - Текст, используемый для заполнения объекта.
//  СтандартнаяОбработка - Булево       - В данный параметр передается признак выполнения системной обработки события.
//
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийДокументаСервер.ОбработкаЗаполнения(ЭтотОбъект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка,"Товары") Тогда
		Возврат;
	КонецЕсли;
	
	// Заполняем специфические для данной операции реквизиты
	Если НЕ ЗначениеЗаполнено(Сделка) Тогда
		Сделка = ДанныеЗаполнения;
	КонецЕсли;
	Если ЗначениеЗаполнено(Сделка) Тогда
		Основание = Сделка;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ПринятоОТ) И ЗначениеЗаполнено(Контрагент) Тогда
		ПринятоОТ = СокрЛП(Контрагент.НаименованиеПолное);
	КонецЕсли;	
	
	КурсВалютыВзаиморасчетов = РаботаСКурсамиВалютПлатформа.ПолучитьКурсВалютыВзаиморасчетов(ЭтотОбъект, ?(НЕ ЗначениеЗаполнено(ДоговорВзаиморасчетов), Неопределено, ДоговорВзаиморасчетов), ?(НЕ ЗначениеЗаполнено(ДокументОснование), Неопределено, ДокументОснование));
	
	// Произведем дозаполнение объекта остатком по сделке
	Если ЗначениеЗаполнено(ДокументОснование) И ДополнительныеСвойства.Свойство("ВыполненоЗаполнениеНаОсновании") И ДополнительныеСвойства.ВыполненоЗаполнениеНаОсновании=Неопределено Тогда
		ЗаполнитьОстаткомПоСделке();
	КонецЕсли;
	
	Если ТипЗнч(ДанныеЗаполнения)<>Тип("ДокументСсылка.ЗакрытиеСмены") Тогда
		// изменим ставку НДС, если нужно
		Если ЗначениеЗаполнено(ДанныеЗаполнения) Тогда
			ОбработкаСобытийДокументаСервер.УстановитьСтавкуНДС(ДанныеЗаполнения, ЭтотОбъект, СуммаДокумента);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры // ОбработкаЗаполнения()

// Обработчик события заполнения объекта копированием.
//
// Параметры:
//  ОбъектКопирования - ДокументОбъект - Исходный объект, который является источником копирования.
//
Процедура ПриКопировании(ОбъектКопирования)
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийДокументаСервер.ПриКопировании(ЭтотОбъект, ОбъектКопирования) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ПриКопировании()

// Обработчик события возникающего при необходимости проверки заполнения реквизитов при записи или при проведении.
//
// Параметры:
//  Отказ                - Булево - Признак отказа от продолжения работы после выполнения проверки заполнения.
//  ПроверяемыеРеквизиты - Массив - Массив путей к реквизитам, для которых будет выполнена проверка заполнения.
//
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийДокументаСервер.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты) Тогда
		Возврат;
	КонецЕсли;
	
	Если СуммаДокумента<0 Тогда
		ВывестиСообщение(НСтр("ru = 'Сумма документа не должна быть отрицательной'"),, "СуммаДокумента",,Отказ);
	КонецЕсли;

КонецПроцедуры // ОбработкаПроверкиЗаполнения()

// Обработчик события возникающего после начала транзакции записи, но до начала записи объекта.
//
// Параметры:
//  Отказ           - Булево                   - Признак отказа от совершения операции.
//  РежимЗаписи     - РежимЗаписиДокумента     - Текущий режим записи документа.
//  РежимПроведения - РежимПроведенияДокумента - Текущий режим проведения.
//
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийДокументаСервер.ПередЗаписью(ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения) Тогда
		Возврат;
	КонецЕсли;
	
	РаботаСГраницами.МоментВремениПередПроведением(Ссылка, ДополнительныеСвойства);
	РаботаСГраницами.ДвиженияПоВзаиморасчетамПередПроведением(Ссылка, ДополнительныеСвойства);
		
КонецПроцедуры // ПередЗаписью()

// Обработчик события возникающего после записи объекта в базу данных, но до окончания транзакции записи.
//
// Параметры:
//  Отказ - Булево - Признак отказа от совершения операции.
//
Процедура ПриЗаписи(Отказ)
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийДокументаСервер.ПриЗаписи(ЭтотОбъект, Отказ) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ПриЗаписи()

// Обработчик события возникающего в транзакции удаления перед непосредственным удалением объекта из базы данных.
//
// Параметры:
//  Отказ - Булево - Признак отказа от совершения операции.
//
Процедура ПередУдалением(Отказ)
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийДокументаСервер.ПередУдалением(ЭтотОбъект, Отказ) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ПередУдалением()

// Обработчик события возникающего при отмене проведения документа. Выполняется в транзакции записи.
//
// Параметры:
//  Отказ - Булево - Признак отказа от совершения операции.
//
Процедура ОбработкаУдаленияПроведения(Отказ)
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийДокументаСервер.ОбработкаУдаленияПроведения(ЭтотОбъект, Отказ) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ОбработкаУдаленияПроведения()

// Обработчик события возникающего в транзакции записи для формирования движений документу по подчиненным регистрам.
//
// Параметры:
//  Отказ           - Булево                   - Признак отказа от совершения операции.
//  РежимПроведения - РежимПроведенияДокумента - Текущий режим проведения.
//
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийДокументаСервер.ОбработкаПроведения(ЭтотОбъект, Отказ, РежимПроведения) Тогда
		Возврат;
	КонецЕсли;
	
	ВедетсяБалансПоПодразделению = БалансВедетсяПоПодразделениям(Дата);
	
	// Приходуем деньги в кассу
	НаборЗаписейДС=Движения.ДенежныеСредстваКомпании;
	НаборЗаписейДС.ДокументОбъект=ЭтотОбъект;
	НаборЗаписейДС.РежимПроведения=РежимПроведения;
	НаборЗаписейДС.СтруктурнаяЕдиница=КассаКомпании;
	НаборЗаписейДС.СтатьяДДС=СтатьяДДС;
	НаборЗаписейДС.Валюта=Неопределено;
	НаборЗаписейДС.Сумма=СуммаДокумента;
	Отказ=НЕ НаборЗаписейДС.Приход() ИЛИ Отказ;
	
	// Если используем подключаемой оборудование проведем деньги по кассе ККМ
	Если ДляПробитияНаФР И ЗначениеЗаполнено(КассаККМ) Тогда
		
		НаборЗаписейКассыККМ=Движения.КассыККМ;
		НаборЗаписейКассыККМ.ДокументОбъект 	= ЭтотОбъект;
		НаборЗаписейКассыККМ.РежимПроведения 	= РежимПроведения;
		НаборЗаписейКассыККМ.КассаККМ 			= КассаККМ;
		НаборЗаписейКассыККМ.СпособОплаты 		= Справочники.ТипыОплат.Наличные;
		НаборЗаписейКассыККМ.Сумма 			    = СуммаДокумента;
		Отказ=НЕ НаборЗаписейКассыККМ.Приход() ИЛИ Отказ;
		
		Если НЕ Отказ Тогда
			НаборЗаписейКассыККМ.Записать();
		КонецЕсли;
		
		НаборЗаписейКассыККМ=Движения.КассыККМ;
		НаборЗаписейКассыККМ.ДокументОбъект 	= ЭтотОбъект;
		НаборЗаписейКассыККМ.РежимПроведения 	= РежимПроведения;
		НаборЗаписейКассыККМ.КассаККМ 			= КассаККМ;
		НаборЗаписейКассыККМ.СпособОплаты 		= Справочники.ТипыОплат.Наличные;
		НаборЗаписейКассыККМ.Сумма 			    = СуммаДокумента;
		Отказ=НЕ НаборЗаписейКассыККМ.Расход() ИЛИ Отказ;
		
	КонецЕсли;
	
	// Проводим взаиморасчеты
	НаборЗаписейВзаиморасчеты=Движения.ВзаиморасчетыКомпании;
	НаборЗаписейВзаиморасчеты.ДокументОбъект=ЭтотОбъект;
	НаборЗаписейВзаиморасчеты.РежимПроведения=РежимПроведения;
	НаборЗаписейВзаиморасчеты.Контрагент=Контрагент;
	НаборЗаписейВзаиморасчеты.ДоговорВзаиморасчетов=ДоговорВзаиморасчетов;
	Если ЗначениеЗаполнено(Сделка)Тогда
		Если ЕстьРеквизит(Сделка, "ДокументОснование") И ЗначениеЗаполнено(Сделка.ДокументОснование) И ТипЗнч(Сделка.ДокументОснование)=Тип("ДокументСсылка.ЗаказПокупателя")
			И Сделка.ХозОперация<>Справочники.ХозОперации.РеализацияТоваровКомиссия И ДоговорВзаиморасчетов.СпособЗакрытияСделок=Перечисления.СпособЗакрытияСделок.ПоСчетамИЗаказам Тогда
			
			НаборЗаписейВзаиморасчеты.Сделка = Сделка.ДокументОснование;
		Иначе
			НаборЗаписейВзаиморасчеты.Сделка = Сделка;
		КонецЕсли;
		ТипСделка=ТипЗнч(Сделка);
		Если ЗаказыСервер.ПолучитьТипыСделок(Ложь).СодержитТип(ТипСделка) Тогда
			НаборЗаписейВзаиморасчеты.ВзаиморасчетыСПокупателем=Ложь;
		ИначеЕсли ЗаказыСервер.ПолучитьТипыСделок(Истина).СодержитТип(ТипСделка) Тогда
			НаборЗаписейВзаиморасчеты.ВзаиморасчетыСПокупателем=Истина;
		Иначе
			НаборЗаписейВзаиморасчеты.ВзаиморасчетыСПокупателем=Неопределено;
		КонецЕсли;
	Иначе
		НаборЗаписейВзаиморасчеты.Сделка=Неопределено;
	КонецЕсли;
	НаборЗаписейВзаиморасчеты.АвтоЗакрытиеСделок=АвтоЗакрытиеСделок;
	НаборЗаписейВзаиморасчеты.Сумма=СуммаДокумента;
	НаборЗаписейВзаиморасчеты.СуммаДоходаРасходаСуммовыхРазниц=0;
	Отказ=НЕ НаборЗаписейВзаиморасчеты.Расход() ИЛИ Отказ;
	
	// Доходы и расходы по суммовым разницам
	СуммаДоходаРасходаСуммовыхРазниц=НаборЗаписейВзаиморасчеты.СуммаДоходаРасходаСуммовыхРазниц;
	Если СуммаДоходаРасходаСуммовыхРазниц<>0 Тогда
		НаборЗаписейДиР = Движения.ДоходыИРасходы;
		НаборЗаписейДиР.ДокументОбъект = ЭтотОбъект;
		Если ВедетсяБалансПоПодразделению Тогда
			НаборЗаписейДиР.Подразделение = ДоговорВзаиморасчетов.ПодразделениеКомпании;
		КонецЕсли;
		НаборЗаписейДиР.СтатьяДоходовИРасходов = Справочники.СтатьиДоходовИРасходов.СуммовыеРазницы;
		НаборЗаписейДиР.ВУпрВалюте = Истина;
		Если СуммаДоходаРасходаСуммовыхРазниц<0 Тогда
			НаборЗаписейДиР.Расход = -СуммаДоходаРасходаСуммовыхРазниц;
		Иначе
			НаборЗаписейДиР.Доход = СуммаДоходаРасходаСуммовыхРазниц;
		КонецЕсли;
		Отказ = НЕ НаборЗаписейДиР.Приход() ИЛИ Отказ;
	КонецЕсли;
	
	// Определим необходимость формирования корректирующих проводок
	ПодразделениеКасса = Справочники.ПодразделенияКомпании.ПолучитьБалансовоеПодразделение(КассаКомпании.ПодразделениеКомпании, Дата);
	ПодразделениеДоговорВзаиморасчетов = Справочники.ПодразделенияКомпании.ПолучитьБалансовоеПодразделение(ДоговорВзаиморасчетов.ПодразделениеКомпании, Дата);
	БалансовыеПодразделенияНеРавны = (ПодразделениеДоговорВзаиморасчетов<>ПодразделениеКасса);
	Если ВедетсяБалансПоПодразделению И БалансовыеПодразделенияНеРавны Тогда
		НаборЗаписейДиР = Движения.ДоходыИРасходы;
		
		НаборЗаписейДиР.ДокументОбъект			= ЭтотОбъект;
		НаборЗаписейДиР.Подразделение			= КассаКомпании.ПодразделениеКомпании;
		НаборЗаписейДиР.СтатьяДоходовИРасходов	= Справочники.СтатьиДоходовИРасходов.КорректировкаБалансаПоПодразделениям;
		НаборЗаписейДиР.ВУпрВалюте				= Ложь;
		НаборЗаписейДиР.Доход					= СуммаДокумента;
		Отказ = НЕ НаборЗаписейДиР.Приход() ИЛИ Отказ;
		
		НаборЗаписейДиР.ДокументОбъект			= ЭтотОбъект;
		НаборЗаписейДиР.Подразделение			= ДоговорВзаиморасчетов.ПодразделениеКомпании;
		НаборЗаписейДиР.СтатьяДоходовИРасходов	= Справочники.СтатьиДоходовИРасходов.КорректировкаБалансаПоПодразделениям;
		НаборЗаписейДиР.ВУпрВалюте				= Ложь;
		НаборЗаписейДиР.Расход					= СуммаДокумента;
		Отказ = НЕ НаборЗаписейДиР.Приход() ИЛИ Отказ;
	КонецЕсли;
	
	// Зафиксируем наличную оплату
	Если ХозОперация = Справочники.ХозОперации.ПриходныйКассовыйОрдер Тогда
		НаборЗаписейНаличныеРасчеты=Движения.НаличныеРасчеты;
		НаборЗаписейНаличныеРасчеты.ДокументОбъект 	= ЭтотОбъект;
		НаборЗаписейНаличныеРасчеты.РежимПроведения 	= РежимПроведения;
		НаборЗаписейНаличныеРасчеты.Контрагент 	= Контрагент;
		НаборЗаписейНаличныеРасчеты.СуммаНаличными = СуммаДокумента;
		НаборЗаписейНаличныеРасчеты.ДоговорВзаиморасчетов = ДоговорВзаиморасчетов;
		Отказ = НЕ НаборЗаписейНаличныеРасчеты.Приход() ИЛИ Отказ;
	КонецЕсли;
	
	// Возможно расхождение баланса на "копейки" из-за округления.
	// Возникшую разницу необходимо списать на доходы и расходы.
	Отказ = НЕ ОбработкаСобытийДокументаСервер.СписаниеКопейкиПриОкругленииВалютныхСчетов(ЭтотОбъект) ИЛИ Отказ;
	
	// Двигаем границу последовательности взаиморасчетов
	РаботаСГраницами.СдвинутьГраницуВзаиморасчетов(Ссылка, ДополнительныеСвойства, Движения);
	
	// Проведение в Платежный календарь
	Если Не Отказ Тогда
		НаборЗаписей = Движения.ПлатежныйКалендарь;
		НаборЗаписей.ДокументОбъект = Ссылка;
		НаборЗаписей.Поступление    = Истина;
		НаборЗаписей.Факт();
	КонецЕсли;
	
КонецПроцедуры // ОбработкаПроведения()


#Область Инициализация

////////////////////////////////////////////////////////////////////////////////
// ИСПОЛНЯЕМАЯ ЧАСТЬ МОДУЛЯ

// Установим параметры проверки документа
ДополнительныеСвойства.Вставить("ПроверкаИсторическогоПорядкаОпераций", ЛОЖЬ);

#КонецОбласти

#КонецЕсли
